In [1]:
import pandas as pd
import numpy as np

In [5]:
data=[{'a':i,'b':2*i}
    for i in range(3)]

In [8]:
print(data)
print(type(data))

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]
<class 'list'>

In [9]:
print(pd.DataFrame(data))
print(type(pd.DataFrame(data)))

   a  b
0  0  0
1  1  2
2  2  4
<class 'pandas.core.frame.DataFrame'>

In [14]:
pd.DataFrame([{'a':1,'b':2},{'b':3,'c:':4}])

     a  b   c:
0  1.0  2  NaN
1  NaN  3  4.0

In [18]:
pd.DataFrame(np.random.rand(3,2)),columns=['foo','bar'],row=[122,122],

SyntaxError: cannot assign to function call (600355529.py, line 1)

In [23]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [25]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [26]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [27]:
data.area is data['area']

True

In [28]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [29]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763